In [1]:
import pandas as pd

In [2]:
l1 = [1,2,3,4]
d1 = pd.DataFrame(l1)
d1

   0
0  1
1  2
2  3
3  4

In [5]:
l2 = {'a':[1,2,3,4],'b':[1,3,2,1]}
d2 = pd.DataFrame(l2)
d2

   a  b
0  1  1
1  2  3
2  3  2
3  4  1

In [6]:
l3 = [[1,2,3,4],[1,2,3,4],[1,2,3,4]]
d3 = pd.DataFrame(l3)
d3

   0  1  2  3
0  1  2  3  4
1  1  2  3  4
2  1  2  3  4

In [7]:
l4 = {'id':[1,2,3,4],'sn':[1,2,3,4],'pd':[1,2,3,4]}
d4= pd.DataFrame(l4)
d4

   id  sn  pd
0   1   1   1
1   2   2   2
2   3   3   3
3   4   4   4

In [8]:
l5 = [{'a':937,'b':93},{'a':3774,'b':948,'c':837}]
d5 = pd.DataFrame(l5)
d5

      a    b      c
0   937   93    NaN
1  3774  948  837.0

In [9]:
l6 = {'id':pd.Series([1,2,3,4])}
d6 = pd.DataFrame(l6)
d6

   id
0   1
1   2
2   3
3   4